frontend/controllers/SiteController.php

    public function actionComment1()
    {
        if (Yii::$app->user->isGuest)
            return $this->goHome();
        // find certain news
        $news = news::findAll(['id' => 1]);
        $comment = Comment::findAll(['New_id' => 1]);
---
SELECT * FROM `Comment` WHERE `New_id`=1

    public function actionComment2()
    {
        if (Yii::$app->user->isGuest)
            return $this->goHome();
        // find certain news
        $news = news::findAll(['id' => 2]);
        $comment = Comment::findAll(['New_id' => 2]);
---
SELECT * FROM `Comment` WHERE `New_id`=2