common/models/User.php

SELECT * FROM `User` WHERE `account`='123456789012345678'
---
    public static function findIdentity($account)
    {
        return static::findOne(['account' => $account]);