backend/views/site/managecomments.php

SELECT * FROM `Comment`
---
use common\models\Comment;

$news = \common\models\news::find()->all();
$comment = \common\models\Comment::find()->all();

SELECT * FROM `Comment` WHERE `New_id`='1'
---
                        </div>
                        <?php if ($news != null)
	                    foreach ($news as $_news) : ?>
                            <?php $comment_temp = \common\models\Comment::findAll(['New_id' => $_news->id]);?>