backend/views/site/userinfo.php

<?php

$user = \common\models\User::findAll(['type' => 0]);
---
SELECT * FROM `User` WHERE `type`=0