frontend/models/SignupForm.php

    public function signup()
    {
        // if (!$this->validate()) {
        //     return null;
        // }

        $user = new User();
        $user->account = $this->account;
        $user->setPassword($this->password);
        $user->setUsername($this->username);
        $user->setTel($this->tel);
        $user->setType(0);
        $user->generateAuthKey();

        return $user->save();
---
INSERT INTO `User` (`account`, `password_hash`, `username`, `tel`, `type`, `auth_key`) VALUES ('123456789012345678', '$2y$13$b18kpom8GSXJcpG89tB15eC2/HO3qZT.6q5oKT76wgnwRkRL8Vkg.', 'u1', '12345678901', '0', 'NMJi4E3lf1h4Z1j6cLPM6xAFwFZ-Ul1v')