frontend/views/site/about.php

SELECT * FROM `Teammember` WHERE `captain`=1
---
    $tmp = $tmp[0];
else $tmp = null;

$captain = \common\models\TeamMember::findOne(['captain' => 1]);

SELECT * FROM `Teammember` WHERE `captain`=0
---
// if ($captain != null)
//     $captain_user = \common\models\User::findIdentity($captain->account);

$teamers = \common\models\TeamMember::findAll(['captain' => 0]);