frontend/views/site/comment1.php

use yii\widgets\LinkPager;
use frontend\controllers\SiteController;

$comment1 = \common\models\Comment::findAll(['New_id' => 1]);
---
SELECT * FROM `Comment` WHERE `New_id`=1