frontend/views/site/comment2.php

use yii\widgets\LinkPager;
use frontend\controllers\SiteController;

$comment2 = \common\models\Comment::findAll(['New_id' => 2]);
---
SELECT * FROM `Comment` WHERE `New_id`=2