frontend/views/site/index.php

SELECT * FROM `Refugee` WHERE `destination`='波兰'
SELECT * FROM `Refugee` WHERE `destination`='罗马尼亚'
SELECT * FROM `Refugee` WHERE `destination`='俄罗斯'
SELECT * FROM `Refugee` WHERE `destination`='匈牙利'
SELECT * FROM `Refugee` WHERE `destination`='斯洛伐克'
SELECT * FROM `Refugee` WHERE `destination`='摩尔多瓦'
SELECT * FROM `Refugee` WHERE `destination`='白俄罗斯'
---
$cnt = 2;

//难民数据
$Refugee_poland = \common\models\Refugee::findOne(['destination' => '波兰']);
$Refugee_romania = \common\models\Refugee::findOne(['destination' => '罗马尼亚']);
$Refugee_russia = \common\models\Refugee::findOne(['destination' => '俄罗斯']);
$Refugee_hungary = \common\models\Refugee::findOne(['destination' => '匈牙利']);
$Refugee_slovakia = \common\models\Refugee::findOne(['destination' => '斯洛伐克']);
$Refugee_moldova = \common\models\Refugee::findOne(['destination' => '摩尔多瓦']);
$Refugee_belarus = \common\models\Refugee::findOne(['destination' => '白俄罗斯']);